stubs/webhooks/request/payout-success.json

{
  "id": 226,
  "request_amount": 0.2,
  "request_currency": "USD",
  "account_amount": 737.9934,
  "account_currency": "UGX",
  "transaction_fee": 21.4018,
  "total_debit": 716.5916,
  "provider_id": "mtn_ug",
  "merchant_reference": "76859aae-f148-48c5-9901-2e474cf19b71",
  "internal_reference": "DUSUPAY405GZM1G5JXGA71IK",
  "transaction_status": "COMPLETED",
  "transaction_type": "payout",
  "message": "Transaction Completed Successfully",
  "account_number": "256777111786 - Optional",
  "account_name": "- Optional",
  "institution_name": "MTN Mobile Money - Optional"
}